In [1]:
import pandas as pd

In [3]:
friend_list = [
    ['name', ['john', 'jenny', 'nate']],
    ['age', [20,30,40]],
    ['job', ['student', 'teacher', 'manager']]
]

In [9]:
df = pd.DataFrame.from_dict(dict(friend_list))
df

    name  age      job
0   john   20  student
1  jenny   30  teacher
2   nate   40  manager

In [10]:
df[1:3]

    name  age      job
1  jenny   30  teacher
2   nate   40  manager

In [11]:
friend_list = [
    ['name', ['john', 'jenny', 'nate']],
    ['age', [20,30,40]],
    ['job', ['student', 'teacher', 'manager']]
]
df = pd.DataFrame.from_dict(dict(friend_list))
df

    name  age      job
0   john   20  student
1  jenny   30  teacher
2   nate   40  manager

In [12]:
df.loc[[0,2]]

   name  age      job
0  john   20  student
2  nate   40  manager

In [14]:
df[df.age> 25]

    name  age      job
1  jenny   30  teacher
2   nate   40  manager

In [17]:
df.query('age >25')

    name  age      job
1  jenny   30  teacher
2   nate   40  manager

In [19]:
df[(df.age>25) & (df.name == 'nate')]

   name  age      job
2  nate   40  manager

In [20]:
df.iloc[:, 0:2]

    name  age
0   john   20
1  jenny   30
2   nate   40

In [23]:
df = pd.read_csv('/Users/yonghyunpark/Desktop/Programming/DataAnalysis/friend_list.csv', header= None, names=['name', 'age', 'job'])

In [24]:
df

       name  age         job
0      name  age         job
1      john   20     student
2     Jenny   24   developer
3      nate   21     teacher
4     chris   40     dentist
5     brian   35     manager
6  yonghyun   29  researcher

In [25]:
df_filtered = df[['name' , 'age']]

In [26]:
df_filtered

       name  age
0      name  age
1      john   20
2     Jenny   24
3      nate   21
4     chris   40
5     brian   35
6  yonghyun   29

In [27]:
df.filter(items=['age', 'job'])

   age         job
0  age         job
1   20     student
2   24   developer
3   21     teacher
4   40     dentist
5   35     manager
6   29  researcher

In [28]:
df

       name  age         job
0      name  age         job
1      john   20     student
2     Jenny   24   developer
3      nate   21     teacher
4     chris   40     dentist
5     brian   35     manager
6  yonghyun   29  researcher

In [31]:
df.filter(like='a', axis=1)

       name  age
0      name  age
1      john   20
2     Jenny   24
3      nate   21
4     chris   40
5     brian   35
6  yonghyun   29

In [34]:
df.filter(regex='b$', axis=1)

          job
0         job
1     student
2   developer
3     teacher
4     dentist
5     manager
6  researcher

In [6]:
%matplotlib inline
import matplotlib.pyplot as plt